Ran Plan for project: `prod` dir: `environments/prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
23:14:56.929 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./net
- Module ./null


23:14:57.142 INFO   [null] Downloading Terraform configurations from ../../modules/null_resource into ./null/.terragrunt-cache/QLoGvuy2tix8fB8rMags9tmiMy8/d1oe809qNTHiBeOBkt54SHt-miw
23:14:57.149 INFO   [net] Downloading Terraform configurations from ../../modules/vpc into ./net/.terragrunt-cache/4BkNCia55dYG8O55O3iG2r6DUFw/J9L90idEJHtl0vLyB25y2Vb2P3Y
23:14:57.215 INFO   [null] terraform: Initializing the backend...
23:14:57.216 INFO   [null] terraform: Initializing provider plugins...
23:14:57.216 INFO   [null] terraform: - Finding latest version of hashicorp/aws...
23:14:57.218 INFO   [net] terraform: Initializing the backend...
23:14:57.221 INFO   [net] terraform: Initializing provider plugins...
23:14:57.221 INFO   [net] terraform: - Finding latest version of hashicorp/aws...
23:14:57.378 INFO   [null] terraform: - Finding latest version of hashicorp/null...
23:14:57.398 INFO   [net] terraform: - Installing hashicorp/aws v5.88.0...
23:14:57.413 INFO   [null] terraform: - Installing hashicorp/aws v5.88.0...
23:15:21.608 INFO   [net] terraform: - Installed hashicorp/aws v5.88.0 (signed by HashiCorp)
23:15:21.610 INFO   [net] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:15:21.610 INFO   [net] terraform: selections it made above. Include this file in your version control repository
23:15:21.610 INFO   [net] terraform: so that Terraform can guarantee to make the same selections by default when
23:15:21.610 INFO   [net] terraform: you run "terraform init" in the future.
23:15:21.614 INFO   [net] terraform: Terraform has been successfully initialized!
23:15:21.681 INFO   [null] terraform: - Installed hashicorp/aws v5.88.0 (signed by HashiCorp)
23:15:21.698 INFO   [null] terraform: - Installing hashicorp/null v3.2.3...
23:15:22.133 INFO   [null] terraform: - Installed hashicorp/null v3.2.3 (signed by HashiCorp)
23:15:22.134 INFO   [null] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:15:22.134 INFO   [null] terraform: selections it made above. Include this file in your version control repository
23:15:22.134 INFO   [null] terraform: so that Terraform can guarantee to make the same selections by default when
23:15:22.134 INFO   [null] terraform: you run "terraform init" in the future.
23:15:22.135 INFO   [null] terraform: Terraform has been successfully initialized!
23:15:38.813 STDOUT [null] terraform: Terraform used the selected providers to generate the following execution
23:15:38.858 STDOUT [null] terraform: plan. Resource actions are indicated with the following symbols:
23:15:38.858 STDOUT [null] terraform:   + create
23:15:38.858 STDOUT [null] terraform: Terraform will perform the following actions:
23:15:38.858 STDOUT [null] terraform:   # null_resource.example will be created
23:15:38.858 STDOUT [null] terraform:   + resource "null_resource" "example" {
23:15:38.858 STDOUT [null] terraform:       + id       = (known after apply)
23:15:38.858 STDOUT [null] terraform:       + triggers = {
23:15:38.858 STDOUT [null] terraform:           + "always_run" = (known after apply)
23:15:38.858 STDOUT [null] terraform:         }
23:15:38.858 STDOUT [null] terraform:     }
23:15:38.858 STDOUT [null] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:15:38.858 STDOUT [null] terraform: 
23:15:40.919 STDOUT [net] terraform: Terraform used the selected providers to generate the following execution
23:15:40.919 STDOUT [net] terraform: plan. Resource actions are indicated with the following symbols:
23:15:40.920 STDOUT [net] terraform:   + create
23:15:40.920 STDOUT [net] terraform: Terraform will perform the following actions:
23:15:40.925 STDOUT [net] terraform:   # aws_internet_gateway.igw will be created
23:15:40.925 STDOUT [net] terraform:   + resource "aws_internet_gateway" "igw" {
23:15:40.925 STDOUT [net] terraform:       + arn      = (known after apply)
23:15:40.925 STDOUT [net] terraform:       + id       = (known after apply)
23:15:40.925 STDOUT [net] terraform:       + owner_id = (known after apply)
23:15:40.925 STDOUT [net] terraform:       + tags     = {
23:15:40.925 STDOUT [net] terraform:           + "Name" = "Internet Gateway"
23:15:40.925 STDOUT [net] terraform:         }
23:15:40.925 STDOUT [net] terraform:       + tags_all = {
23:15:40.925 STDOUT [net] terraform:           + "Name" = "Internet Gateway"
23:15:40.925 STDOUT [net] terraform:         }
23:15:40.926 STDOUT [net] terraform:       + vpc_id   = (known after apply)
23:15:40.926 STDOUT [net] terraform:     }
23:15:40.926 STDOUT [net] terraform:   # aws_route.public_internet_access will be created
23:15:40.926 STDOUT [net] terraform:   + resource "aws_route" "public_internet_access" {
23:15:40.926 STDOUT [net] terraform:       + destination_cidr_block = "0.0.0.0/0"
23:15:40.926 STDOUT [net] terraform:       + gateway_id             = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + id                     = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + instance_id            = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + instance_owner_id      = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + network_interface_id   = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + origin                 = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + route_table_id         = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + state                  = (known after apply)
23:15:40.926 STDOUT [net] terraform:     }
23:15:40.926 STDOUT [net] terraform:   # aws_route_table.public will be created
23:15:40.926 STDOUT [net] terraform:   + resource "aws_route_table" "public" {
23:15:40.926 STDOUT [net] terraform:       + arn              = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + id               = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + owner_id         = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + propagating_vgws = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + route            = (known after apply)
23:15:40.926 STDOUT [net] terraform:       + tags             = {
23:15:40.926 STDOUT [net] terraform:           + "Name" = "Public Route Table"
23:15:40.926 STDOUT [net] terraform:         }
23:15:40.926 STDOUT [net] terraform:       + tags_all         = {
23:15:40.927 STDOUT [net] terraform:           + "Name" = "Public Route Table"
23:15:40.927 STDOUT [net] terraform:         }
23:15:40.927 STDOUT [net] terraform:       + vpc_id           = (known after apply)
23:15:40.927 STDOUT [net] terraform:     }
23:15:40.927 STDOUT [net] terraform:   # aws_route_table_association.public[0] will be created
23:15:40.927 STDOUT [net] terraform:   + resource "aws_route_table_association" "public" {
23:15:40.927 STDOUT [net] terraform:       + id             = (known after apply)
23:15:40.927 STDOUT [net] terraform:       + route_table_id = (known after apply)
23:15:40.927 STDOUT [net] terraform:       + subnet_id      = (known after apply)
23:15:40.927 STDOUT [net] terraform:     }
23:15:40.927 STDOUT [net] terraform:   # aws_route_table_association.public[1] will be created
23:15:40.927 STDOUT [net] terraform:   + resource "aws_route_table_association" "public" {
23:15:40.927 STDOUT [net] terraform:       + id             = (known after apply)
23:15:40.927 STDOUT [net] terraform:       + route_table_id = (known after apply)
23:15:40.927 STDOUT [net] terraform:       + subnet_id      = (known after apply)
23:15:40.927 STDOUT [net] terraform:     }
23:15:40.927 STDOUT [net] terraform:   # aws_subnet.example["example1"] will be created
23:15:40.927 STDOUT [net] terraform:   + resource "aws_subnet" "example" {
23:15:40.927 STDOUT [net] terraform:       + arn                                            = (known after apply)
23:15:40.927 STDOUT [net] terraform:       + assign_ipv6_address_on_creation                = false
23:15:40.927 STDOUT [net] terraform:       + availability_zone                              = "us-east-1a"
23:15:40.927 STDOUT [net] terraform:       + availability_zone_id                           = (known after apply)
23:15:40.927 STDOUT [net] terraform:       + cidr_block                                     = "10.1.5.0/24"
23:15:40.927 STDOUT [net] terraform:       + enable_dns64                                   = false
23:15:40.927 STDOUT [net] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
23:15:40.927 STDOUT [net] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
23:15:40.927 STDOUT [net] terraform:       + id                                             = (known after apply)
23:15:40.928 STDOUT [net] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
23:15:40.928 STDOUT [net] terraform:       + ipv6_native                                    = false
23:15:40.928 STDOUT [net] terraform:       + map_public_ip_on_launch                        = false
23:15:40.928 STDOUT [net] terraform:       + owner_id                                       = (known after apply)
23:15:40.928 STDOUT [net] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
23:15:40.928 STDOUT [net] terraform:       + tags                                           = {
23:15:40.928 STDOUT [net] terraform:           + "Name" = "example1"
23:15:40.928 STDOUT [net] terraform:         }
23:15:40.928 STDOUT [net] terraform:       + tags_all                                       = {
23:15:40.928 STDOUT [net] terraform:           + "Name" = "example1"
23:15:40.928 STDOUT [net] terraform:         }
23:15:40.928 STDOUT [net] terraform:       + vpc_id                                         = (known after apply)
23:15:40.928 STDOUT [net] terraform:     }
23:15:40.928 STDOUT [net] terraform:   # aws_subnet.private[0] will be created
23:15:40.928 STDOUT [net] terraform:   + resource "aws_subnet" "private" {
23:15:40.928 STDOUT [net] terraform:       + arn                                            = (known after apply)
23:15:40.928 STDOUT [net] terraform:       + assign_ipv6_address_on_creation                = false
23:15:40.928 STDOUT [net] terraform:       + availability_zone                              = "us-east-1a"
23:15:40.928 STDOUT [net] terraform:       + availability_zone_id                           = (known after apply)
23:15:40.928 STDOUT [net] terraform:       + cidr_block                                     = "10.1.3.0/24"
23:15:40.928 STDOUT [net] terraform:       + enable_dns64                                   = false
23:15:40.928 STDOUT [net] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
23:15:40.928 STDOUT [net] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
23:15:40.928 STDOUT [net] terraform:       + id                                             = (known after apply)
23:15:40.928 STDOUT [net] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
23:15:40.928 STDOUT [net] terraform:       + ipv6_native                                    = false
23:15:40.928 STDOUT [net] terraform:       + map_public_ip_on_launch                        = false
23:15:40.929 STDOUT [net] terraform:       + owner_id                                       = (known after apply)
23:15:40.929 STDOUT [net] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
23:15:40.929 STDOUT [net] terraform:       + tags                                           = {
23:15:40.929 STDOUT [net] terraform:           + "Name" = "Private Subnet 0"
23:15:40.929 STDOUT [net] terraform:         }
23:15:40.929 STDOUT [net] terraform:       + tags_all                                       = {
23:15:40.929 STDOUT [net] terraform:           + "Name" = "Private Subnet 0"
23:15:40.929 STDOUT [net] terraform:         }
23:15:40.929 STDOUT [net] terraform:       + vpc_id                                         = (known after apply)
23:15:40.929 STDOUT [net] terraform:     }
23:15:40.929 STDOUT [net] terraform:   # aws_subnet.private[1] will be created
23:15:40.929 STDOUT [net] terraform:   + resource "aws_subnet" "private" {
23:15:40.929 STDOUT [net] terraform:       + arn                                            = (known after apply)
23:15:40.929 STDOUT [net] terraform:       + assign_ipv6_address_on_creation                = false
23:15:40.929 STDOUT [net] terraform:       + availability_zone                              = "us-east-1b"
23:15:40.929 STDOUT [net] terraform:       + availability_zone_id                           = (known after apply)
23:15:40.929 STDOUT [net] terraform:       + cidr_block                                     = "10.1.4.0/24"
23:15:40.929 STDOUT [net] terraform:       + enable_dns64                                   = false
23:15:40.929 STDOUT [net] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
23:15:40.929 STDOUT [net] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
23:15:40.929 STDOUT [net] terraform:       + id                                             = (known after apply)
23:15:40.929 STDOUT [net] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
23:15:40.929 STDOUT [net] terraform:       + ipv6_native                                    = false
23:15:40.929 STDOUT [net] terraform:       + map_public_ip_on_launch                        = false
23:15:40.929 STDOUT [net] terraform:       + owner_id                                       = (known after apply)
23:15:40.929 STDOUT [net] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
23:15:40.930 STDOUT [net] terraform:       + tags                                           = {
23:15:40.930 STDOUT [net] terraform:           + "Name" = "Private Subnet 1"
23:15:40.930 STDOUT [net] terraform:         }
23:15:40.930 STDOUT [net] terraform:       + tags_all                                       = {
23:15:40.930 STDOUT [net] terraform:           + "Name" = "Private Subnet 1"
23:15:40.930 STDOUT [net] terraform:         }
23:15:40.930 STDOUT [net] terraform:       + vpc_id                                         = (known after apply)
23:15:40.930 STDOUT [net] terraform:     }
23:15:40.930 STDOUT [net] terraform:   # aws_subnet.public[0] will be created
23:15:40.930 STDOUT [net] terraform:   + resource "aws_subnet" "public" {
23:15:40.930 STDOUT [net] terraform:       + arn                                            = (known after apply)
23:15:40.930 STDOUT [net] terraform:       + assign_ipv6_address_on_creation                = false
23:15:40.930 STDOUT [net] terraform:       + availability_zone                              = "us-east-1a"
23:15:40.930 STDOUT [net] terraform:       + availability_zone_id                           = (known after apply)
23:15:40.930 STDOUT [net] terraform:       + cidr_block                                     = "10.1.1.0/24"
23:15:40.930 STDOUT [net] terraform:       + enable_dns64                                   = false
23:15:40.931 STDOUT [net] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
23:15:40.931 STDOUT [net] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
23:15:40.931 STDOUT [net] terraform:       + id                                             = (known after apply)
23:15:40.931 STDOUT [net] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
23:15:40.931 STDOUT [net] terraform:       + ipv6_native                                    = false
23:15:40.931 STDOUT [net] terraform:       + map_public_ip_on_launch                        = true
23:15:40.931 STDOUT [net] terraform:       + owner_id                                       = (known after apply)
23:15:40.941 STDOUT [net] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
23:15:40.942 STDOUT [net] terraform:       + tags                                           = {
23:15:40.942 STDOUT [net] terraform:           + "Name" = "Public Subnet 0"
23:15:40.942 STDOUT [net] terraform:         }
23:15:40.942 STDOUT [net] terraform:       + tags_all                                       = {
23:15:40.942 STDOUT [net] terraform:           + "Name" = "Public Subnet 0"
23:15:40.942 STDOUT [net] terraform:         }
23:15:40.942 STDOUT [net] terraform:       + vpc_id                                         = (known after apply)
23:15:40.942 STDOUT [net] terraform:     }
23:15:40.942 STDOUT [net] terraform:   # aws_subnet.public[1] will be created
23:15:40.942 STDOUT [net] terraform:   + resource "aws_subnet" "public" {
23:15:40.942 STDOUT [net] terraform:       + arn                                            = (known after apply)
23:15:40.942 STDOUT [net] terraform:       + assign_ipv6_address_on_creation                = false
23:15:40.942 STDOUT [net] terraform:       + availability_zone                              = "us-east-1b"
23:15:40.942 STDOUT [net] terraform:       + availability_zone_id                           = (known after apply)
23:15:40.942 STDOUT [net] terraform:       + cidr_block                                     = "10.1.2.0/24"
23:15:40.942 STDOUT [net] terraform:       + enable_dns64                                   = false
23:15:40.942 STDOUT [net] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
23:15:40.942 STDOUT [net] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
23:15:40.942 STDOUT [net] terraform:       + id                                             = (known after apply)
23:15:40.942 STDOUT [net] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
23:15:40.942 STDOUT [net] terraform:       + ipv6_native                                    = false
23:15:40.942 STDOUT [net] terraform:       + map_public_ip_on_launch                        = true
23:15:40.942 STDOUT [net] terraform:       + owner_id                                       = (known after apply)
23:15:40.942 STDOUT [net] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
23:15:40.943 STDOUT [net] terraform:       + tags                                           = {
23:15:40.943 STDOUT [net] terraform:           + "Name" = "Public Subnet 1"
23:15:40.943 STDOUT [net] terraform:         }
23:15:40.943 STDOUT [net] terraform:       + tags_all                                       = {
23:15:40.943 STDOUT [net] terraform:           + "Name" = "Public Subnet 1"
23:15:40.943 STDOUT [net] terraform:         }
23:15:40.943 STDOUT [net] terraform:       + vpc_id                                         = (known after apply)
23:15:40.943 STDOUT [net] terraform:     }
23:15:40.944 STDOUT [net] terraform:   # aws_vpc.main will be created
23:15:40.944 STDOUT [net] terraform:   + resource "aws_vpc" "main" {
23:15:40.944 STDOUT [net] terraform:       + arn                                  = (known after apply)
23:15:40.946 STDOUT [net] terraform:       + cidr_block                           = "10.1.0.0/16"
23:15:40.946 STDOUT [net] terraform:       + default_network_acl_id               = (known after apply)
23:15:40.946 STDOUT [net] terraform:       + default_route_table_id               = (known after apply)
23:15:40.946 STDOUT [net] terraform:       + default_security_group_id            = (known after apply)
23:15:40.946 STDOUT [net] terraform:       + dhcp_options_id                      = (known after apply)
23:15:40.946 STDOUT [net] terraform:       + enable_dns_hostnames                 = true
23:15:40.948 STDOUT [net] terraform:       + enable_dns_support                   = true
23:15:40.948 STDOUT [net] terraform:       + enable_network_address_usage_metrics = (known after apply)
23:15:40.948 STDOUT [net] terraform:       + id                                   = (known after apply)
23:15:40.948 STDOUT [net] terraform:       + instance_tenancy                     = "default"
23:15:40.948 STDOUT [net] terraform:       + ipv6_association_id                  = (known after apply)
23:15:40.948 STDOUT [net] terraform:       + ipv6_cidr_block                      = (known after apply)
23:15:40.949 STDOUT [net] terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
23:15:40.949 STDOUT [net] terraform:       + main_route_table_id                  = (known after apply)
23:15:40.949 STDOUT [net] terraform:       + owner_id                             = (known after apply)
23:15:40.949 STDOUT [net] terraform:       + tags                                 = {
23:15:40.949 STDOUT [net] terraform:           + "Name" = "my-vpc"
23:15:40.949 STDOUT [net] terraform:         }
23:15:40.949 STDOUT [net] terraform:       + tags_all                             = {
23:15:40.949 STDOUT [net] terraform:           + "Name" = "my-vpc"
23:15:40.949 STDOUT [net] terraform:         }
23:15:40.949 STDOUT [net] terraform:     }
23:15:40.949 STDOUT [net] terraform: Plan: 11 to add, 0 to change, 0 to destroy.
23:15:40.949 STDOUT [net] terraform:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://ip-172-31-20-182.ec2.internal:4141/lock?id=naveenkerati%252Fatlantis-tf-playground%252Fenvironments%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```